 (function(){
	miData = {
		//starGoods
		starGoods:{
			imgSrc:["img/stargoods/1.png","img/stargoods/2.png","img/stargoods/3.png","img/stargoods/4.jpg","img/stargoods/5.png","img/stargoods/6.jpg","img/stargoods/7.jpg","img/stargoods/8.png","img/stargoods/9.jpg","img/stargoods/10.jpg"],
			title : ['小米手机5 尊享版' , '小米Max 高配版' , '红米手机3S', '小米平板2 16GB现货' , '小米电视3S 48英寸','小米手机4c','小米盒子3 增强版' ,'小米手环 2' ,'小蚁智能摄像机 夜视版' ,'米家压力IH电饭煲'],
			detail : ['4GB内存+128GB闪存，陶瓷版' , '6.44英寸大屏，3GB内存+64GB容量' , '金属机身，指纹识别，超长待机' , '轻薄全金属，海量内容' , '原装液晶屏，金属机身，足量现货','快、轻薄、美，青春五色可选' , '高端 4K 网络机顶盒','每天早10点开售','能看能听能说，手机远程控制','用聪明的锅，做幸福的饭'],
			price : ['2699元' , '1699元' ,'699元起' ,'999元','1999元','1099元','399元','149元','149元','999元']
		},
		//match
		match:{
			hot:{
				title:["  小米活塞耳机 基础版  ","  小米移动电源10000mAh  ","  小米圈铁耳机  ","  小米移动电源10000mAh 高配版  ","  小米插线板  ","  小米蓝牙耳机  ","  小米蓝牙音箱  ","小米小钢炮蓝牙音箱 青春版 象牙白"],
				price:["29元","79元","99元","149元","49元","29元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","1.9万人评价","1万人评价","53万人评价","15万人评价"]
			},
			ear:{
				title:["  小米活塞耳机 基础版  ","  小米移动电源10000mAh  ","  小米圈铁耳机  ","  小米移动电源10000mAh 高配版  ","  小米插线板  ","  小米蓝牙耳机  ","  小米蓝牙音箱  ","小米小钢炮蓝牙音箱 青春版 象牙白"],
				price:["29元","79元","99元","149元","49元","29元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","1.9万人评价","1万人评价","53万人评价","15万人评价"]
			},
			power:{
				title:["  小米活塞耳机 基础版  ","  小米移动电源10000mAh  ","  小米圈铁耳机  ","  小米移动电源10000mAh 高配版  ","  小米插线板  ","  小米蓝牙耳机  ","  小米蓝牙音箱  ","小米小钢炮蓝牙音箱 青春版 象牙白"],
				price:["29元","79元","99元","149元","49元","29元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","1.9万人评价","1万人评价","53万人评价","15万人评价"]
			},
			card:{
				title:["  小米活塞耳机 基础版  ","  小米移动电源10000mAh  ","  小米圈铁耳机  ","  小米移动电源10000mAh 高配版  ","  小米插线板  ","  小米蓝牙耳机  ","  小米蓝牙音箱  ","小米小钢炮蓝牙音箱 青春版 象牙白"],
				price:["29元","79元","99元","149元","49元","29元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","1.9万人评价","1万人评价","53万人评价","15万人评价"]
			},
			length:4,
			attr:["hot","ear","power","card"]
		}
	}
})();